# FunctionId Class

---
The information of a function throwing an exception.
SystemObject Autodesk.Revit.ExceptionsFunctionId
**Namespace:** Autodesk.Revit.Exceptions**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

    [SerializableAttribute]
    public class FunctionId : ISerializable

    <SerializableAttribute>
    Public Class FunctionId
    	Implements ISerializable

    [SerializableAttribute]
    public ref class FunctionId : ISerializable

    [<SerializableAttribute>]
    type FunctionId =
        class
            interface ISerializable
        end
The FunctionId type exposes the following members.
| Name| Description
---|---|---
| File| The name of the file including the function throwing an exception.
| Function| The name of the function throwing an exception.
| Line| The line number of the function throwing an exception.
Top
| Name| Description
---|---|---
| Equals| Determines whether the specified object is equal to the current object.(Inherited from Object)
| GetHashCode| Serves as the default hash function.(Inherited from Object)
| GetObjectData| Retrieves data needed to serialize the target object.
| GetType| Gets the Type of the current instance.(Inherited from Object)
| ToString| Returns a string that represents the current object.(Inherited from Object)
Top
#### Reference
Autodesk.Revit.Exceptions Namespace